# Python Data Science Handbook
## Chapter 3 - Data Manipulation with Pandas

In [1]:
import pandas 

pandas.__version__

'0.25.1'

In [2]:
import numpy as np 
import pandas as pd

The Pandas Series Object

In [3]:
# A Pandas Series is a one-dimensional array of indexed data.
# It can be created from a list or array as follows:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
# The Series wraps both a sequence of values and a sequence of indices.
print(type(data.values))
data.values

<class 'numpy.ndarray'>

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
# The index is an array-like object of type pd.Index
print(type(data.index))
data.index

<class 'pandas.core.indexes.range.RangeIndex'>

RangeIndex(start=0, stop=4, step=1)

In [6]:
data[1]

0.5

In [7]:
data[1:3]

1    0.50
2    0.75
dtype: float64

Series as generalized NumPy array

In [8]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
    index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [9]:
 data['b']

0.5

In [10]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
    index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [11]:
data[5]

0.5

Series as specialized dictionary

In [12]:
# We can make the Series-as-dictionary analogy even
# more clear by constructing a Series object directly
# from a Python dictionary:
population_dict = {
    'California': 38332521,
    'Texas': 26448193,
    'New York': 19651127,
    'Florida': 19552860,
    'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [13]:
population['California']

38332521

In [14]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

Constructing Series objects

In [15]:
# By default the index is an integer
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

In [16]:
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [17]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In [18]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

#### The Pandas DataFrame Object

If a *Series* is an analog of a one-dimensional array with flexible indices, a *DataFrame* is an analog of a two-dimensional array with both flexible row indices and flexible column names.

DataFrame as a generalized NumPy array

In [19]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
    'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [20]:
states = pd.DataFrame({'population': population,
    'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [21]:
# the DataFrame has an index attribute that gives access to the index labels
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [23]:
# the DataFrame has a columns attribute, which is an Index object holding
# the column labels:
states.columns

Index(['population', 'area'], dtype='object')

DataFrame as specialized dictionary

In [24]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

**Constructing DataFrame objects from:**
+ From a single Series object (vector);
+ From a list of dicts;
+ From a dictionary of Series objects;
+ From a two-dimensional NumPy array;
+ From a NumPy structured array.

#### The Pandas Index Object

In [25]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

Index as immutable array

In [26]:
print(ind[1])
print(ind[::2])
print(ind.size, ind.shape, ind.ndim, ind.dtype)

3
Int64Index([2, 5, 11], dtype='int64')
5 (5,) 1 int64

In [27]:
# indices are immuta‐ ble—that is, they cannot be modified
# via the normal means:

# ind[1] = 0

# TypeError: Index does not support mutable operations

Index as ordered set

In [28]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [29]:
indA & indB # intersection

Int64Index([3, 5, 7], dtype='int64')

In [30]:
indA | indB # union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [31]:
indA ^ indB # symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

## Data Indexing and Selection
#### Data Selection in Series
Series as dictionary

In [32]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
    index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [33]:
data['b']

0.5

In [34]:
'a' in data

True

In [35]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [36]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [37]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

#### Series as one-dimensional array

In [38]:
# slicing by explicit index 
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [39]:
# slicing by implicit integer index 
data[0:2]

a    0.25
b    0.50
dtype: float64

In [40]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [41]:
# fancy indexing 
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [42]:
# slicing with an explicit index (i.e., data['a':'c']), the
# final index is included in the slice, while when you’re 
# slicing with an implicit index (i.e., data[0:2]), the final
# index is excluded from the slice.

Indexers: loc, iloc, and ix

In [43]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [44]:
# explicit index when indexing
data[1]

'a'

In [45]:
# implicit index when slicing 
data[1:3]

3    b
5    c
dtype: object

In [46]:
# loc attribute allows indexing and slicing that
# always references the explicit index:
data.loc[1]

'a'

In [47]:
data.loc[1:3]

1    a
3    b
dtype: object

In [48]:
# iloc attribute allows indexing and slicing that
# always references the implicit Python-style index:
data.iloc[1]

'b'

In [49]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [50]:
# The explicit nature of loc and iloc make them very 
# useful in maintaining clean and readable code;
# It prevents subtle bugs due to the mixed indexing/slicing convention.

#### Data Selection in DataFrame
DataFrame as a dictionary

In [51]:
area = pd.Series({'California': 423967, 'Texas': 695662,
    'New York': 141297, 'Florida': 170312,
    'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
     'New York': 19651127, 'Florida': 19552860,
     'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [52]:
# Access individual Series
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [53]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [54]:
data.area is data['area']

True

In [55]:
# Add a new column
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

DataFrame as two-dimensional array

In [56]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [57]:
# We can transpose the full DataFrame to swap rows and columns
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [58]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [59]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [60]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [61]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [62]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [63]:
data.loc[0, 2] = 90
data

                area         pop     density     2
California  423967.0  38332521.0   90.413926   NaN
Texas       695662.0  26448193.0   38.018740   NaN
New York    141297.0  19651127.0  139.076746   NaN
Florida     170312.0  19552860.0  114.806121   NaN
Illinois    149995.0  12882135.0   85.883763   NaN
0                NaN         NaN         NaN  90.0

Additional indexing conventions

In [64]:
data['Florida':'Illinois']

              area         pop     density   2
Florida   170312.0  19552860.0  114.806121 NaN
Illinois  149995.0  12882135.0   85.883763 NaN

In [65]:
data[1:3]

              area         pop     density   2
Texas     695662.0  26448193.0   38.018740 NaN
New York  141297.0  19651127.0  139.076746 NaN

In [66]:
data[data.density > 100]

              area         pop     density   2
New York  141297.0  19651127.0  139.076746 NaN
Florida   170312.0  19552860.0  114.806121 NaN

## Operating on Data in Pandas
Ufuncs preserve index and column labels in the output, and for binary operations such as addition and multiplication, Pandas will automatically align indices when passing the objects to the ufunc.
#### Ufuncs: Index Preservation

In [80]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [81]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
    columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [84]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [85]:
# for a slightly more complex calculation
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

#### UFuncs: Index Alignment
Index alignment in Series

In [87]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
    'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
    'New York': 19651127}, name='population')

In [88]:
# The resulting array contains the union of indices of the two input arrays
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [89]:
# union of indices of the two input arrays
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [90]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [91]:
# Fill missing values with the value in argument fill_value
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

Index alignment in DataFrame

In [93]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
    columns=list('AB'))
A

    A   B
0   0  11
1  11  16

In [94]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
    columns=list('BAC'))
B

   B  A  C
0  9  2  6
1  3  8  2
2  4  2  6

In [95]:
A + B

      A     B   C
0   2.0  20.0 NaN
1  19.0  19.0 NaN
2   NaN   NaN NaN

In [96]:
# Fill with the mean of all values in A
# for the missing values
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   2.0  20.0  15.5
1  19.0  19.0  11.5
2  11.5  13.5  15.5

In [ ]:
# Mapping between Python operators and Pandas methods

#   Python operator  Pandas method(s)
# --------------------------------------
#         +              add()
#         -         sub(), subtract()
#         *         mul(), multiply()
#         /    truediv(), div(), divide()
#         //           floordiv()
#         %              mod()
#         **             pow()

#### Ufuncs: Operations Between DataFrame and Series

In [97]:
A = rng.randint(10, size=(3, 4))
A

array([[4, 8, 6, 1],
       [3, 8, 1, 9],
       [8, 9, 4, 1]])

In [98]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1,  0, -5,  8],
       [ 4,  1, -2,  0]])

In [99]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1  0 -5  8
2  4  1 -2  0

In [111]:
df

   Q  R  S  T
0  4  8  6  1
1  3  8  1  9
2  8  9  4  1

In [112]:
# df - df['R']
df.subtract(df['R'], axis='index')

   Q  R  S  T
0 -4  0 -2 -7
1 -5  0 -7  1
2 -1  0 -5 -8

In [113]:
halfrow = df.iloc[0, ::2] # row 0
halfrow

Q    4
S    6
Name: 0, dtype: int64

In [114]:
# DataFrame/Series operations, like the operations discussed before,
# automatically align indices between the two elements:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN -5.0 NaN
2  4.0 NaN -2.0 NaN

## Handling Missing Data
The difference between data found in many tutorials and data in the real world is that real-world data is rarely clean and homogeneous. In particular, many interesting datasets will have some amount of data missing. To make matters even more compli‐ cated, different data sources may indicate missing data in different ways.

Missing data is generally referenced as: null, NaN, or NA values

#### Trade-Offs in Missing Data Conventions

Two strategies to indicate the presence of missing data in a DataFrame: 
+ **mask:** that globally indicates missing values
+ **sentinel value:** that indicates a missing entry

In the **masking approach**, the mask might be an entirely separate Boolean array, or it may involve appropriation of one bit in the data representation to locally indicate the null status of a value.

In the *sentinel approach*, the sentinel value could be some data-specific convention, such as indicating a missing integer value with –9999 or some rare bit pattern, or it could be a more global convention, such as indicating a missing floating-point value with NaN (Not a Number), a special value which is part of the IEEE floating-point specification.

None of these approaches is without trade-offs: use of a separate mask array requires allocation of an additional Boolean array, which adds overhead in both storage and computation. A sentinel value reduces the range of valid values that can be repre‐ sented, and may require extra (often non-optimized) logic in CPU and GPU arith‐ metic. Common special values like NaN are not available for all data types.

As in most cases where no universally optimal choice exists, different languages and systems use different conventions. For example, the R language uses reserved bit pat‐ terns within each data type as sentinel values indicating missing data, while the SciDB system uses an extra byte attached to every cell to indicate a NA state.

#### Missing Data in Pandas

Curiosity: R has a single integer type, NumPy supports fourteen basic integer types

#### None: Pythonic missing data

In [123]:
vals = np.array([1, 2, 3, 4])
vals

array([1, 2, 3, 4])

In [124]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [119]:
for dtype in ['object', 'int']: 
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum() 
    print()

dtype = object
76.3 ms ± 1.36 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
2.08 ms ± 24 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [125]:
# Error since it has an object representation
# vals1.sum()

NaN: Missing numerical data

In [126]:
# NumPy chose a native floating-point type for this array
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [127]:
1 + np.nan

nan

In [128]:
0 *  np.nan

nan

In [129]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [130]:
# NumPy does provide some special aggregations that ignore these missing values:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

# NaN is specifically a floating-point value; there is no equivalent
# NaN value for integers, strings, or other types.

(8.0, 1.0, 4.0)

NaN and None in Pandas

NaN and None both have their place, and Pandas is built to handle the two of them nearly interchangeably, converting between them where appropriate:

In [131]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [132]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [134]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [135]:
# Notice that in addition to casting the integer array to floating point,
# Pandas automatically converts the None to a NaN value.

# Pandas handling of NAs by type

#    Typeclass    Conversion when storing NAs   NA sentinel value
# -------------- ----------------------------- --------------------
#    floating              No change                  np.nan
#    object                No change              None or np.nan
#    integer            Cast to float64               np.nan
#    boolean            Cast to object            None or np.nan

# In Pandas the string data is always stored with an object dtype.

## Operating on Null Values

+ isnull(): Generate a Boolean mask indicating missing values;
+ notnull(): Opposite of isnull();
+ dropna(): Return a filtered version of the data;
+ fillna(): Return a copy of the data with missing values filled or imputed

Detecting null values

In [137]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [138]:
data[data.notnull()]

0        1
2    hello
dtype: object

Dropping null values

In [140]:
# Drop null values for a Series
data.dropna()

0        1
2    hello
dtype: object

In [141]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [142]:
# Drop null values for a Dataframe
df.dropna()

     0    1  2
1  2.0  3.0  5

In [143]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [144]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [145]:
# Drop only the columns where all values are null
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [146]:
# thresh: minimum number of non-null values for the row/column to be kept
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

Filling null values

In [148]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [149]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [150]:
# forward-fill: propagate the previous value forward:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [151]:
# back-fill: propagate the next values backward
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [152]:
# With dataframes is similar
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [161]:
df.fillna(method='ffill', axis='columns')

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

## Hierarchical Indexing

#### A Multiply Indexed Series

The bad way

In [162]:
index = [('California', 2000), ('California', 2010),
    ('New York', 2000), ('New York', 2010),
    ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
              18976457, 19378102,
              20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [163]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [164]:
# Select all values from 2010
# This is not convenient
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

The better way: Pandas MultiIndex

In [166]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [171]:
# If we reindex our series with this MultiIndex, 
# we see the hierarchical representation of the da
pop = pop.reindex(index)
pop

# Here the first two columns of the Series representation show
# the multiple index val‐ ues, while the third column shows the data.

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [172]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

MultiIndex as extra dimension

In [175]:
# unstack() method will quickly convert a multiplyindexed
# Series into a conventionally indexed DataFrame
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [176]:
# stack() method provides the opposite operation
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [178]:
# Just as we were able to use multi-indexing to represent 
# two-dimensional data within a one-dimensional Series, we
# can also use it to represent data of three or more dimensions
# in a Series or DataFrame.
# Each extra level in a multi-index represents an extra dimension of data;

pop_df = pd.DataFrame({'total': pop,
    'under18': [9267089, 9284094,
                4687374, 4318033,
                5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [179]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

#### Methods of MultiIndex Creation

In [180]:
df = pd.DataFrame(np.random.rand(4, 2),
    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns=['data1', 'data2'])
df

        data1     data2
a 1  0.535332  0.119286
  2  0.865890  0.371568
b 1  0.503522  0.764548
  2  0.045479  0.672788

In [181]:
# Automatically recognizes this and use a MultiIndex by default:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

Explicit MultiIndex constructors

In [182]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [183]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [184]:
# It constructs from a Cartesian product of single indices
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [187]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
    codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

MultiIndex level names

In [188]:
# Name the indexes of the MultiIndex
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

MultiIndex for columns

Just as the rows can have multiple levels of indices, the columns can have multiple levels as well

In [228]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
    names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
    names=['subject', 'type']) 

# mock some data
data = np.round(np.random.randn(4, 6), 1)                          
data[:, ::2] *= 10
data += 37
                                     
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      37.0  35.8  26.0  35.4  43.0  38.3
     2      38.0  37.1  36.0  37.5  16.0  35.8
2014 1      49.0  36.3  34.0  35.9  47.0  36.3
     2      41.0  37.1  46.0  37.0  42.0  37.9

In [229]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      26.0  35.4
     2      36.0  37.5
2014 1      34.0  35.9
     2      46.0  37.0

For complicated records containing multiple labeled measurements across multiple times for many subjects (people, countries, cities, etc.), use of hierarchical rows and columns can be extremely convenient!

#### Indexing and Slicing a MultiIndex

Multiply indexed Series

In [230]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [231]:
pop['California', 2000]

33871648

In [232]:
# Partial indexing
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [233]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [237]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [238]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [239]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

Multiply indexed DataFrames

In [240]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      37.0  35.8  26.0  35.4  43.0  38.3
     2      38.0  37.1  36.0  37.5  16.0  35.8
2014 1      49.0  36.3  34.0  35.9  47.0  36.3
     2      41.0  37.1  46.0  37.0  42.0  37.9

In [241]:
health_data['Guido', 'HR']

year  visit
2013  1        26.0
      2        36.0
2014  1        34.0
      2        46.0
Name: (Guido, HR), dtype: float64

In [247]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      37.0  35.8
     2      38.0  37.1

In [248]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        37.0
      2        38.0
2014  1        49.0
      2        41.0
Name: (Bob, HR), dtype: float64

In [253]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      37.0  26.0  43.0
2014 1      49.0  34.0  47.0

#### Rearranging Multi-Indices

Sorted and unsorted indices

In [263]:
# The indices are not lexographically sorted

index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.216235
      2      0.710576
c     1      0.885337
      2      0.655524
b     1      0.125106
      2      0.600589
dtype: float64

In [266]:
try:
    data['a':'b'] 
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [267]:
data = data.sort_index()
data

char  int
a     1      0.216235
      2      0.710576
b     1      0.125106
      2      0.600589
c     1      0.885337
      2      0.655524
dtype: float64

In [268]:
# With the index sorted in this way, partial slicing will work as expected:
data['a':'c']

char  int
a     1      0.216235
      2      0.710576
b     1      0.125106
      2      0.600589
c     1      0.885337
      2      0.655524
dtype: float64

Stacking and unstacking indices

In [269]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [270]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [271]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

Index setting and resetting

In [272]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [300]:
# set_index method of the DataFrame returns a 
# multiply indexed Data Frame:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

#### Data Aggregations on Multi-Indices
Pandas has built-in data aggregation methods, such as mean(), sum(), and max(). For hierarchically indexed data, these can be passed a level parameter that controls which subset of the data the aggregate is computed on.

In [301]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      37.0  35.8  26.0  35.4  43.0  38.3
     2      38.0  37.1  36.0  37.5  16.0  35.8
2014 1      49.0  36.3  34.0  35.9  47.0  36.3
     2      41.0  37.1  46.0  37.0  42.0  37.9

In [304]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     37.5  36.45  31.0  36.45  29.5  37.05
2014     45.0  36.70  40.0  36.45  44.5  37.10

In [309]:
data_mean.mean(axis='columns', level='type')

type         HR   Temp
year
2013  32.666667  36.65
2014  43.166667  36.75

This syntax is actually a shortcut to the GroupBy functionality.

Pandas has a few other fundamental data structures that we have not yet discussed, namely the pd.Panel (3-dimensional) and pd.Panel4D (4-dimensional) objects.

## Combining Datasets: Concat and Append

In [312]:
# Build a dataframe with a particular form

def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    
    # example DataFrame
    return pd.DataFrame(data=data, index=ind) 

make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

#### Recall: Concatenation of NumPy Arrays

In [313]:
x=[1,2,3] 
y=[4,5,6] 
z=[7,8,9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [316]:
x = [[1, 2],
     [3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

#### Simple Concatenation with pd.concat

In [322]:
# Signature in Pandas v0.18

#pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False,
#    keys=None, levels=None, names=None, verify_integrity=False,
#    copy=True)

ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [325]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])

print(df1); print(df2); print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [328]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
print(df3); print(df4); print(pd.concat([df3, df4], axis='columns'))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

Duplicate indices

In [329]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index # make duplicate indices! 
print(x); print(y); print(pd.concat([x, y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

Catching the repeats as an error

In [331]:
try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

Ignoring the index

In [332]:
print(x); print(y); print(pd.concat([x, y], ignore_index=True))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

Adding MultiIndex keys

In [333]:
print(x); print(y); print(pd.concat([x, y], keys=['x', 'y']))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

Concatenation with joins

In [342]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5); print(df6); print(pd.concat([df5, df6], sort=False))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [343]:
# The entries for which no data is available are filled with NA values.
# By default, the join is a union of the input columns (join='outer'),
# but we can change this to an intersection of the columns using join='inner'
print(df5); print(df6); 
print(pd.concat([df5, df6], join='inner'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [346]:
print(df5); print(df6);
print(pd.concat([df5, df6], join_axes=[df5.columns]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.

#### The append() method

Append method that can accomplish the same thing as concat in fewer keystrokes

The append() method in Pandas does not modify the original object—instead, it creates a new object with the combined data. It also is not a very efficient method, because it involves creation of a new index and data buffer. Thus, if you plan to do multiple append operations, it is generally better to build a list of DataFrames and pass them all at once to the concat() function.

In [347]:
print(df1); print(df2); print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

## Combining Datasets: Merge and Join

If you have ever worked with databases, you should be familiar with this type of data interaction.

#### Relational Algebra
pd.merge(): subset of what is known as relational algebra; 
Pandas implements several of these fundamental building blocks in the pd.merge() function and the related join() method of Series and DataFrames.

#### Categories of Joins
The pd.merge() function implements a number of types of joins: 
+ One-to-one;
+ Many-to-one; 
+ Many-to-many joins.

*One-to-one*

In [349]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
    'hire_date': [2004, 2008, 2012, 2014]}) 
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [350]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

*Many-to-one*

In [351]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
    'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print(df4); print(pd.merge(df3, df4))

# The resulting DataFrame has an additional column with the
# “supervisor” information, where the information is repeated
# in one or more locations as required by the inputs.

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

*Many-to-many joins*

Many-to-many joins are a bit confusing conceptually, but are nevertheless well defined. If the key column in both the left and right array contains duplicates, then the result is a many-to-many merge.

In [352]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
    'Engineering', 'Engineering', 'HR', 'HR'],
    'skills': ['math', 'spreadsheets', 'coding', 'linux',
    'spreadsheets', 'organization']})
print(df1); print(df5); print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In practice, datasets are rarely as clean as the one we’re working with here.

#### Specification of the Merge Key

The on keyword

In [353]:
# Explicitly specify the name of the key column using the on keyword
print(df1); print(df2); print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

The left_on and right_on keywords

In [355]:
# At times you may wish to merge two datasets with different
# column names; for exam‐ ple, we may have a dataset in which
# the employee name is labeled as “name” rather than “employee”
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3);
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [359]:
# The result has a redundant column (i.e., employee or name)
# that we can drop if desired
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

The left_index and right_index keywords

In [360]:
# Sometimes, rather than merging on a column, you would
# instead like to merge on an index.
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [361]:
print(df1a); print(df2a);
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [362]:
# For convenience, DataFrames implement the join() method,
# which performs a merge that defaults to joining on indices:
print(df1a); print(df2a); print(df1a.join(df2a))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [363]:
# mix indices and columns:
print(df1a); print(df3);
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

#### Specifying Set Arithmetic for Joins

In [364]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
    'food': ['fish', 'beans', 'bread']},
    columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
    'drink': ['wine', 'beer']},
    columns=['name', 'drink']) 
print(df6); print(df7); print(pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [367]:
# Here we have merged two datasets that have only a single
# “name” entry in common: Mary. By default, the result contains
# the intersection of the two sets of inputs; this is what is 
# known as an inner join. We can specify this explicitly using 
# the how keyword, which defaults to 'inner':

pd.merge(df6, df7, how='inner') # = pd.merge(df6, df7)

   name   food drink
0  Mary  bread  wine

In [368]:
# Other options for the how keyword are 'outer', 'left',
# and 'right'. Fills in all missing values with NAs:
print(df6); print(df7); print(pd.merge(df6, df7, how='outer'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [369]:
# The left join and right join return join over the left entries
# and right entries, respectively.
print(df6); print(df7); print(pd.merge(df6, df7, how='left'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

#### Overlapping Column Names: The suffixes Keyword

In [371]:
# Finally, you may end up in a case where your two input
# DataFrames have conflicting column names. Consider this
# example:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'rank': [3, 1, 4, 2]})
print(df8); print(df9); print(pd.merge(df8, df9, on="name"))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [372]:
print(df8); print(df9);
print(pd.merge(df8, df9, on="name", suffixes=["_L", "_R"]))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

#### Example: US States Data

In [395]:
pop = pd.read_csv('data/state-population.csv')
areas = pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')
print(pop.head()); print(areas.head()); print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [396]:
# We’ll start with a many-to-one merge. We want to merge
# based on the state/region column of pop, and the abbreviation
# column of abbrevs. We’ll use how='outer' to make sure no data
# is thrown away due to mismatched labels.
merged = pd.merge(pop, abbrevs, how='outer',
    left_on='state/region', right_on='abbreviation')
merged = merged.drop('abbreviation', 1) # drop duplicate info 
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [397]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [398]:
# Some of the population info is null; let’s figure out which these are!
merged[merged['population'].isnull()].head()

# null population values are from Puerto Rico prior to the
# year 2000; this is likely due to this data not being available
# from the original source.

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [399]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [400]:
# We can fix these quickly by filling in appropriate entries:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

# No more nulls in the state column

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [401]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [402]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [403]:
# Which regions were ignored here:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [404]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [405]:
# Select the portion of the data corresponding with the year
# 2000, and the total population
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [406]:
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']

In [407]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [408]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

## Aggregation and Grouping

An essential piece of analysis of large data is efficient summarization: computing aggregations like sum(), mean(), median(), min(), and max(), in which a single num‐ ber gives insight into the nature of a potentially large dataset.

#### Planets Data

In [410]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [411]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

#### Simple Aggregation in Pandas

In [412]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [413]:
ser.sum()

2.811925491708157

In [414]:
ser.mean()

0.5623850983416314

In [415]:
# For a DataFrame, by default the aggregates return results
# within each column:
df = pd.DataFrame({'A': rng.rand(5),
    'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [416]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [417]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [418]:
# There is a convenience method describe() that computes several
# common aggregates for each column and returns the result.
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [ ]:
# Listing of Pandas aggregation methods
# 
#    Aggregation             Description
# -------------------------------------------
#      count()          Total number of items
#  first(), last()       First and last item
#  mean(),median()         Mean and median
#   min(), max()         Minimum and maximum
#   std(), var()  Standard deviation and variance
#       mad()          Mean absolute deviation
#      prod()           Product of all items
#       sum()             Sum of all items